tap "adembc/tap"
tap "bwya77/tap"
tap "charmbracelet/tap"
tap "leoafarias/fvm"
tap "rileychh/tap", "git@github.com:rileychh/homebrew-tap.git"
tap "steipete/tap"
# Run your GitHub Actions locally
brew "act"
# New file format for still image compression
brew "jpeg-xl"
# Toolchain of the web
brew "biome"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Vector graphics library with cross-device output support
brew "cairo"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Utils for conversion of cap/pcap/pcapng WiFi dump files
brew "hcxtools"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Dex to Java decompiler
brew "jadx"
# Simple terminal UI for git commands
brew "lazygit"
# Library for encoding and decoding .avif files
brew "libavif"
# Portable library for network traffic capture
brew "libpcap"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Deep clean and optimize your Mac
brew "mole"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Simplified-traditional Chinese conversion tool
brew "opencc"
# Swiss-army knife of markup format conversion
brew "pandoc"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line tool to customize Spotify client
brew "spicetify-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A simple terminal UI for managing SSH connections.  
brew "adembc/tap/lazyssh"
# Generate images of code and terminal output.
brew "charmbracelet/tap/freeze"
# Claude Code statusline renderer with Nerd Font icons and OSC 8 hyperlinks
brew "rileychh/tap/cc-statusline"
# Enable Windows-like alt-tab
cask "alt-tab"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Control and anchor the macOS Dock programmatically
cask "bwya77/tap/dockanchor"
# Menu bar app that detects busy-loop processes and offers to kill them
cask "rileychh/tap/spin-doctor"
# Menu bar manager
cask "thaw"
cask "transmission-remote-gui"
